{
    "projects": [
        {"title": "SimoriON", "img": "simori_on.png", "desc": "A project emulating the functionality of a Yamaha Tenori-On made with a team of 4 others for the second-year Software Engineering class at the University of Exeter.", "gh": "https://github.com/MWJones96/SimoriOn", "year": "03/2016"},
        {"title": "Java Chess Game", "img": "chess.png", "desc": "A simple Chess game that was originally implemented in Java with the GUI made using the Swing library. Contains all of the standard chess functionality in a simple and non-intrusive user interface.", "gh": "https://github.com/MWJones96/Chess", "year": "10/2017"},
        {"title": "Calculator", "img": "calculator.png", "desc": "Scientific calculator made using C++ and Qt that performs over 40 functions mathematical operations. Evaluates expressions using the Shunting-Yard algorithm.", "gh": "https://github.com/MWJones96/Scientific-Calculator", "year": "06/2018"},
        {"title": "Chip8 Interpreter", "img": "chip8.png", "desc": "An interpreter written in Python for the Chip8 interpreted programming language first appearing on the Telmac 1800 computer in the 1970s. Reads in a binary data file and fetches each opcode one at a time and executes the appropriate instruction. Graphics, sound and controls are implemented using the Pygame library.", "gh": "https://github.com/MWJones96/Chip8-Interpreter", "year": "02/2018"},
        {"title": "Tetris", "img": "py_tetris.png", "desc": "Implemented a fully-featured Tetris game using Python and the Pygame library, allowing for piece movement and rotating while falling down at a constant rate. Game keeps track of score and level as filled rows are removed as the game is in play. Game terminates if a block is placed out-of-bounds. Speed of blocks falling increases with level.", "gh": "https://github.com/MWJones96/PyTetris", "year": "10/2018"},
        {"title": "Snake Game", "img": "snake_game.png", "desc": "Snake game written in Python using the Pygame library. Keeps score of how many pieces the snake has eaten as well as increasing its length and speed accordingly. The snake is stored as a linked list allowing for each insertion of elements at the beginning and end of the snake cleanly and in constant time.", "gh": "https://github.com/MWJones96/Snake-Game-Py", "year": "10/2018"},
        {"title": "Weather App", "img": "weather.png", "desc": "An Android application that can fetch real-time weather data from any location on Earth. Used Google Maps OpenWeatherMap APIs, where a forecast can be fetched, and subsequently presented to the user in either a 5-day or 2-day format.", "gh": "https://github.com/MWJones96/Weather-App", "year": "04/2017"},
        {"title": "EZ ML", "img": "sb.png", "desc": "A web application made with a team of 3 others at SB Hacks V, allowing users to create custom Machine Learning models without writing code, built using Python, Flask, Bootstrap, GCP Cloud Functions and Twilio API.", "gh": "https://github.com/MWJones96/SB-Hacks-Project-EZ-ML", "year": "01/2019"},
        {"title": "Research Portal", "img": "csse.png", "desc": "Worked with team of 6 others to build new website for USC CSSE (Center for Systems and Software Engineering), rebuilding old WordPress tech stack into Node.js, connecting USC students, staff and alumni worldwide with a variety of social functionality.", "gh": null, "no_gh_desc": "Source code in private repository.", "year": "12/2019"},
        {"title": "Weenix OS", "img": "weenix.png", "desc": "Developed OS functionality with team of 3 others across 3 separate assignments for CSCI402 at USC.", "gh": null, "no_gh_desc": "Source code not to be distributed at Professor's discretion.", "year": "04/2019"},
        {"title": "eBay Search Android App", "img": "ebay_search_android.jpg", "desc": "An Android version of the eBay Search web application with the same functionality.", "gh": "https://github.com/MWJones96/CSCI-571---Homework-9---Spring-2019", "year": "04/2019"},
        {"title": "eBay Search", "img": "ebay_search.png", "desc": "An Angular and Node.js web application for CSCI571 where user can search for products on eBay and show a detailed product view. Also allows user to save favorite products.", "gh": "https://github.com/MWJones96/CSCI571-HW8---Spring-2019", "year": "04/2019"}
    ]
}